{
  "thoughts": [
    {
      "title": "My garden here",
      "slug": "my-garden-here",
      "postedAt": "2025-01-26T00:31:00.000Z",
      "text": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "My garden here\nwith flowers dear\nall loved and praised\nlike children raised"
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Renown o’er there\nthe glory's dare\na star so bright\nfor time goes blind"
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "My eyes deceived\nby mind's intrigues\nwhich one I've sought?\nhow bad it feels"
              }
            ]
          }
        ]
      },
      "externalLink": null,
      "hidden": false,
      "id": "rec_5"
    },
    {
      "title": "Stairs",
      "slug": "stairs",
      "postedAt": "2024-12-29T09:26:00.000Z",
      "text": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "It had been a few days since I arrived in New York. It was my first time in the US, first time even on a different continent. The airport—which I can only describe as an outdated building from a time before I was born but far from old enough to be considered classic and lacking the elegance of one—slowly led me to my first objective: the subway, and not just because it would get me to my hotel. No, I had seen a lot of the city in movies, shows, and games, and all of that had painted a blurry picture of what I expected on my journey, but this one thing, and I think it was only this one thing, solidified itself as an almost romantic attitude, yet with a clear expectation of something I already knew. The first few minutes on the subway were calm, almost no one else was there with me. Quite the relieve after the nine hour journey packed closely together with others. There was nothing to think about, so I just sat there, enjoying the view while we were still above the ground and had sunlight. Only a few stations later, the whole car was full of people. Now I had the opportunity to listen in on some conversations, get a glimpse into the life of people I’ll never see or hear again. I don’t even remember what they talked about. When my station came I had to slither myself through a group of people, an act that wasn’t quite possible with my luggage. With the remaining confidence I had left I managed to make myself aware to the person before me. Their outright helpful demeanor when they noticed me made me feel surprisingly understood. Crossing the small gap between subway and platform I could now take in the station. It was old, but unlike the airport, it had an elegance to it, a charm. The following days I had a lot of opportunities to ride the subway many more times—at every time of the day. There were more cases of me eavesdropping, or getting lost in thought while listening to the grinding and rolling sound of the wheels, and at times enjoying the violent shaking of the car. Other times I had the luck to be alone with one other person in an entire compartment at night, where I could feel a bit of an uneasiness with a slight anticipation of violence. Of course nothing ever happened. In short, riding the subway was all I wanted it to be."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "My destination was in the heart of Manhattan, the home of Wall Street, a place I was told would be one of the financial epicenters of the world, yet the exit of the station reminded me more of a cave misused as an occasional trash can. A fleeting interpretation, since as soon as I stepped outside into the sunlight, the cave suddenly seemed like a small hole compared to what’s in front of me. I found myself in a ravine of buildings. Somewhere between giant buildings of the likes I’ve never seen before and that my imagination could never have done justice. I anticipated to feel some form of awe or oppression from their height and narrowness, but it was quite the opposite, it made me feel adventurous and even left a hint of inspiration after I realized what it might have taken to built one of them, and then the twenty others I could see, and the hundreds or thousands that I couldn’t see. Somewhat astonished I made my way to the hotel, walking on those sidewalks I had never been on but that looked exactly like they did in the movies. A contrast to the hotel lobby that was as ordinary as they come. I greeted the receptionist and told him about my reservation. He did not take long to give me the cards for my room. While handing them to me he mentioned that I’d have to use the set of elevators on the right, the elevators on the left were for different floors. Then he told me I'd have room 4107, the 41st floor, a pleasant surprise as I imagined it to be quite high up. There were two elevators on the right. A low amount for that many floors, I thought, but I got to my room rather quick. Only to be met with the same uninspired feeling of the airport when I viewed the interior of my room. Fortunately just for a brief moment as the sun that started to set in the distance created a silhouette of what I thought to be New Jersey, behind a glistening Hudson River, and still between skyscrapers that were so much taller than me. Even on the 41st floor. Even when everything on the ground seemed like ants methodically moving around. And this had been my first impression of the city, stepping out of that hole became an unforgettable moment to me."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "About two days must have passed since then, I had a lot of time to explore the city. People asked me if I was jet lagged, but I didn’t notice any difference in that regard, rather, it felt like another one of those cases where my insomnia forced me to see the city at night—and day."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "It was dark again, maybe close to midnight, when I decided to go for another walk. I had left my room to use the elevators in the hallway, only to find a note on one of them stating that it’s under maintenance and that guests may use the service elevator. Partially ignoring what I had just read to not trouble my mind with disrupting my routine, I nonetheless pressed the button for the other elevator and waited. And waited. And more waiting. Ten minutes must have passed while I was just standing there, listening to the sound of people driving up and down numerous times, never stopping at my floor. My endless patience began to clash with my desire for efficiency, so I looked again at the note, trying to understand what they meant by service elevator. I awkwardly looked around and found a room that was clearly meant for staff, judging from the carts with unwashed bed sheets, and boxes that most likely housed distribution boards for all the electricity on the floor. The door was open so I went inside. Now face to face with the service elevator, I decided to leave the room, as it would take me another day to comprehend that this was indeed the service elevator. There even was a button that I pressed, but it just wasn’t meant to be that night. That night, which I thought I had to stay in my room because I’m unable to leave the floor. Back at the elevators in the hallway, the button still glowing to indicate that it had been pressed, I again read the note with the hope it’d explain more now. It did not. But there was another door, a door with a small window that let you see what’s behind. Peeking through, I only saw stairs. Maybe the service elevator was somewhere behind that door? I checked if it was locked. It was not. But no elevator to be seen either. Only stairs, to my right the stairs that went up, and in front of me the stairs that went down. Perhaps the service elevator was located between the floors? I started to walk down. It was about twelve steps, a 90 degree turn to the right, two more steps, just to find myself in what appeared to be the same position I started in."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Again, twelve steps, turn, two steps, same surroundings. I looked at my phone to check the time and noticed that there was no connection, unsurprising, considering the concrete in every direction. Everything looked the same. Minutes must have passed since I started, the floors still with double digits, my sanity maintained by the decreasing numbers on every other turn, and the tendonitis in my right foot, caused by all the walking in the last few days, grew more painful with each step. It was the most unexpected fun. The buzzing sound of the ventilation system and other machines behind the walls, the stuffy air, the slim echo of my footsteps, everlasting repetition. It all created a slight oppression that made me feel like the protagonist of a horror game, as if I were just one door away from entering the backrooms. I didn’t even check if it was possible to open the door from inside, just assumed, or rather, I enjoyed the unknown. Slow and steady yet painfully I made my way down, passing floor for floor, wishing this whole ordeal could last a bit longer. When I got to the second floor, things started to change. The door before me was at a different position. Instead of the window, there was a "
              },
              {
                "type": "text",
                "marks": [
                  {
                    "type": "italic"
                  }
                ],
                "text": "Staff Only"
              },
              {
                "type": "text",
                "text": " note on it. The last flight of stairs did not end with the typical turn, in its place came a long hallway, pipes on each side and the same concrete all around. Was this the cellar? Had I gone too far? With a locked door in front of me I continued. A double door emerged on the end of the corridor. I felt a bit relieved when I saw the sign on it that said "
              },
              {
                "type": "text",
                "marks": [
                  {
                    "type": "italic"
                  }
                ],
                "text": "Lobby"
              },
              {
                "type": "text",
                "text": ". I opened it and found myself in another hallway. The concrete here was covered with white paint, reflecting the white ceiling light. It felt more lively here. I continued once more and saw another sign that guided me to the lobby. And then I was there. Next to the other two elevators that went to a different set of floors than the ones I had to use. Nobody saw me coming out of the door, so anyone who noticed me would assume I had used the elevator. For a second I fantasized how I had to explain to someone that I walked down from the 41st floor because I did not find the service elevator. While exiting the hotel for my night stroll I had already planned to use the same way to get up again. Alas, when I got back the pain was too concerning to risk the ascent, and it was much less waiting to get up from the lobby."
              }
            ]
          }
        ]
      },
      "externalLink": null,
      "hidden": false,
      "id": "rec_4"
    },
    {
      "title": "Machines",
      "slug": "machines",
      "postedAt": "2023-11-11T12:09:00.000Z",
      "text": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "This morning was just like every other morning. Ermen sat down at his desk, looking over all the work from yesterday and in his head already planning how to continue. But before he began, he looked out of the window in front of him."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "There was nothing in particular to see, but to Ermen, it was everything. His world, his inspiration, his future. And with that on his mind, he started."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "His work was a delicate one. A long sequential process that didn’t allow mistakes. But that’s where he found the most joy."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Every piece he created was like a small machine. He then used these small machines to build larger ones, which in turn were used to construct even larger machines, and so on. It was fascinating to see how, at any scale, they would interact with one another, can change each other. It was for this exact reason that he considered them machines."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Today’s work was no exception. He combined his previous work in every possible way, creating a multitude of new pieces, each defined by the parts comprising it."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Sometimes, when Ermen was done with a new set of machines, he played with them for a bit. Throwing them at each other, gently pushing them together, ripping them apart, everything that was possible. This time, however, he just watched them as time passed. After a while, some fell apart into their smaller pieces. Just as he planned."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Ermen smiled as it happened, considering its name would be the indivisible. Not something he came up with, Ciara did. She was the one who named all of his creations, considering nobody knew words better than her. There was also more than just the name to it. Each piece had its own story, or rather multiple, and this was her forte."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "The next day started where the previous one ended. With a new set of parts ready to be built with, he didn’t hesitate long to get going. The possibilities grew and so did the complexity of each piece. The current ones were a bit special though. Under the right circumstances, they would fold together and change their shape, providing new ways to interact with each other. Ciara called these the building blocks of life."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "The names didn’t change how Ermen felt about his creations. In the end, they all belonged together, interact with one another, and they all had their purpose. And it was probably this fact, that they were all interchangeable pieces of a puzzle, that made their creation so fulfilling. This was because, although he created all of it, and even if he decided what they can do, eventually, they’ll act on their own within those given constraints."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Ermen looked out of the window again. There was still nothing to see, but a bit more of that than before. He thought about the names and stories that Ciara told him. The creations he’ll continue to make, from atoms, to cells, to humans, to planets, to universes, and everything before and beyond that."
              }
            ]
          }
        ]
      },
      "externalLink": null,
      "hidden": false,
      "id": "rec_3"
    },
    {
      "title": "Borrowing: An important thing about Rust",
      "slug": null,
      "postedAt": "2018-08-01T22:00:00.000Z",
      "text": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph"
          }
        ]
      },
      "externalLink": "https://medium.com/@AndyBitz/borrowing-an-important-thing-about-rust-3e19c563bf35",
      "hidden": false,
      "id": "rec_2"
    },
    {
      "title": "On making my first browser-online-multiplayer-game",
      "slug": null,
      "postedAt": "2018-04-11T18:00:00.000Z",
      "text": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph"
          }
        ]
      },
      "externalLink": "https://medium.com/@AndyBitz/on-making-my-first-browser-online-multiplayer-game-f0fbce2c9564",
      "hidden": false,
      "id": "rec_1"
    }
  ]
}
